Revit 2027 API
ParameterTypeId.RoomConditionTypeParam Property
 "Condition Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RoomConditionTypeParam { get; }
Public Shared ReadOnly Property RoomConditionTypeParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RoomConditionTypeParam {
	ForgeTypeId^ get ();
}
static member RoomConditionTypeParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace